export const BUNKER_DATA = {
    professions: ["Врач-хирург", "Программист", "Строитель", "Шеф-повар", "Военный снайпер", "Актер театра", "Фермер", "Полицейский", "Учитель химии", "Стример"],
    health: ["Идеально здоров", "Астма (нужен ингалятор)", "Близорукость (-3)", "Хронический кашель", "Аллергия на пыль", "Бесплодие", "Слабое сердце", "Здоров как бык"],
    biology: ["Мужчина, 25 лет", "Женщина, 30 лет", "Мужчина, 50 лет", "Женщина, 22 года", "Мужчина, 19 лет", "Женщина, 45 лет", "Дед, 65 лет"],
    hobbies: ["Рыбалка", "Чтение книг по выживанию", "Видеоигры", "Охота", "Вязание", "Радиотехника", "Ботаника"],
    phobias: ["Клаустрофобия (боязнь замкнутых пространств)", "Арахнофобия", "Боязнь темноты", "Гемофобия (боязнь крови)", "Нет фобий", "Паникофобия"],
    baggage: ["Аптечка (полная)", "Ноутбук с фильмами", "Топор", "Запас консервов на месяц", "Гитара", "Рация", "Набор семян", "Пистолет (2 патрона)"],
    facts: ["Умеет пилотировать вертолет", "Бывший преступник (кража)", "Знает азбуку морзе", "Имеет черный пояс по карате", "Умеет очищать воду", "Храпит во сне"]
};

// Функция для случайного выбора из массива
export function getRandomItem(array) {
    return array[Math.floor(Math.random() * array.length)];
}
